Revit 2027 API
FilledRegionType.IsValidForegroundPatternId Method
 Check if the id is valid for a foreground pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidForegroundPatternId(
	ElementId patternId
)
Public Function IsValidForegroundPatternId (
	patternId As ElementId
) As Boolean
public:
bool IsValidForegroundPatternId(
	ElementId^ patternId
)
member IsValidForegroundPatternId :
        patternId : ElementId -> bool
Parameters
patternId ElementId
 Element id of the FillPatternElement
Return Value
Boolean
 False if in a family, and the id is a FillPatternElement that targets 'Drafting'. True otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 In a family the FillPatternElement must be a 'Drafting' pattern.
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace